able
absence
absolutely
abundant
ac
acceptable
access
accessible
accessory
accommodation
act
actually
additionally
adjacent
adjust
advance
advantage
advertising
advice
advise
advised
affordable
agree
air
airport
alcune
allow
already
also
although
altro
always
amaze
amazing
amenity
annoyed
another
answer
anticipate
anyone
anyway
apart
appear
appreciable
approximate
area
argue
around
arrive
ask
assign
assignor
attend
attention
attentive
available
awaken
away
awful
back
bad
badly
bagno
bale
balm
bang
bar
barely
basic
basically
bat
bath
bathroom
beard
beautiful
bed
bedspread
bench
beside
best
bidet
big
bit
bite
blanket
block
book
booked
booking
boot
bowl
box
break
breakfast
brera
bring
broken
brown
buffet
bug
buia
build
bus
business
but
cabin
caldera
call
camelia
can
cannot
cap
car
care
cared
careful
carpet
case
castle
celebrating
center
central
centralize
chair
chamber
change
characteristic
charge
charm
check
checkin
cheer
child
choice
choose
chose
ciabattine
city
class
classify
classroom
claustrophobic
clean
cleaning
clerk
clock
clog
clogged
close
closest
closet
cmq
coffee
cold
color
com
come
comfort
comfortable
comforts
common
company
complain
complaint
complete
completely
condescend
condition
confirm
congruent
consequent
consider
consideration
construction
continuously
convenient
convert
cordial
correctly
corridor
cosy
could
couldn
counter
course
courteous
courtesy
cover
cozy
crack
crackle
crap
cuisine
cup
curtain
cushion
customer
dark
data
date
dated
daughter
day
dear
decent
decide
deck
decorate
decorated
defect
definitely
degree
deliciously
deliver
deluxe
demonstrate
deserve
desk
despite
detach
detail
di
didn
didnt
different
difficult
din
dinner
dip
dirty
disappointing
discover
discrete
dish
disturb
do
doesnt
dog
don
door
dormitory
double
down
downstairs
drain
drawback
drink
drive
duomo
dust
early
easy
eat
education
effect
either
elevator
email
emanate
embarrass
empty
energy
english
enjoy
enter
entire
entrance
entrust
environment
environments
equally
equip
equipment
erano
especially
essential
etc
euro
euros
even
evening
ever
every
everyone
everything
everywhere
excellent
exceptional
exhaust
existent
expect
expectation
experience
extreme
extremely
fact
fail
fair
fairly
fall
falling
false
fan
fantastic
far
fast
faulty
feature
fee
feel
felt
file
find
first
five
fix
fixed
fixtures
flag
flat
flaw
floor
florence
flow
foam
follow
food
foot
for
forget
former
free
freeze
freezer
frequently
fridge
friend
friendly
front
fugitive
functional
funzionanti
furnished
furniture
furthermore
garage
garden
gate
gather
gelato
get
gf
ghost
give
glass
go
good
gorgeous
graffiti
great
ground
guest
hadn
hair
half
hall
hand
handicap
handle
hang
hanger
happen
hard
hardly
having
hay
hear
heat
heater
height
help
helper
helpful
highly
him
historic
homeless
honest
honestly
hospitable
hostel
hot
hotel
hotels
hour
housekeeping
however
humid
humidity
hung
ibis
ice
idea
if
illuminated
image
immediately
immense
impeccable
impossible
in
inc
inch
include
indecent
inform
inside
instead
intermittent
internal
intolerance
invoice
iron
isn
issue
it
italian
italy
jacuzz
january
judge
july
june
junior
justify
keep
kept
key
kind
know
la
labor
lack
lactose
lampadine
land
large
last
lastnig
late
leak
leaky
leave
left
let
level
lie
life
like
liked
limestone
line
linen
little
livable
living
ll
lo
local
locate
location
lock
loco
london
long
longer
look
looked
lord
lot
lounge
love
lovely
low
luckily
luxurious
machine
magnificent
main
maintain
make
mamroscopic
manage
management
manna
many
maraunal
market
matter
mattress
may
maybe
meal
mean
meant
meat
meet
meter
metro
middle
migrant
milan
milanese
min
mine
mini
minibar
minu
minute
mirror
mislead
mistake
modern
mold
money
more
moreover
morning
mostra
mouquet
move
much
multiple
museum
must
musty
near
nearby
need
negative
neglected
neighborhood
nervous
never
nevio
new
newly
next
nh
nice
night
nightlife
nn
noise
noisy
non
normal
note
nothing
number
observed
obvious
obviously
offer
offered
office
oia
ok
old
once
one
online
only
open
operator
opportunity
ops
optimal
option
orange
order
ordering
organize
orientation
others
otherwise
out
outdated
outdoor
outside
outskirts
overall
overnight
overprice
ox
panoramic
park
parking
part
partner
past
pay
pecci
peel
pension
people
per
perfect
period
person
personal
phone
pick
picols
picture
piece
pillow
pillowcase
place
plain
plan
pleasant
please
plentiful
plug
plus
pm
point
polite
pool
poor
porta
position
positive
possibility
possible
practically
prato
press
price
private
problem
proceed
professional
project
properly
property
prosecco
prove
provide
provision
proximity
put
qualified
quality
quiet
quite
rather
reach
real
realize
really
reason
reasonable
receive
reception
receptionist
recommend
recommendation
rectify
reduce
referenceon
refund
refurbish
regard
relation
relief
remind
renew
renewable
reno
renovate
request
resolve
response
rest
restaurant
resume
return
review
ride
risultava
road
roll
rolms
rome
roof
rooftop
room
rooms
rude
rudeness
ruin
run
rusted
rusty
réception
safe
safety
san
saw
say
scratch
sea
second
security
see
seem
sent
separate
server
service
set
several
shampoo
share
sheet
short
show
shower
showeronly
shutter
side
sight
silence
silent
similar
simple
since
single
sink
siro
site
situation
size
sky
sleep
slipper
small
smell
smelled
smelly
smile
smiling
smoke
smoking
smooth
solve
some
something
sometimes
soundproofed
spacious
speak
special
specifically
speck
spot
square
stadium
staff
stain
stains
stand
standard
stanza
star
stars
start
station
stay
stayed
steam
steer
step
still
stink
stock
stone
stool
stop
strategic
strong
structure
style
suitable
suite
sunset
super
superior
sure
surroundings
sweat
sympatic
table
take
taormina
tap
taste
tastefully
taxi
tea
team
tear
technically
tell
temperature
tent
terrace
terrible
terrify
thank
the
then
there
thermostat
they
thing
think
this
throw
tile
time
timeline
times
tiny
tip
to
toilet
toiletry
told
too
top
total
tourist
tow
towel
train
tram
transport
trip
try
tub
turn
tv
twin
two
ugly
unbeatable
unbelievous
uncomfortable
uncusani
understand
unexpectedly
unfortunately
unkempt
unreliable
unsaid
unwatched
unworthy
up
upgrade
upon
use
used
usually
value
various
vatican
ve
vegetarian
vegnai
vend
venezia
ventilated
very
vetro
view
voucher
wait
walk
wall
want
wardrobe
warm
was
wasn
watch
water
way
waz
we
weak
wear
week
weekends
welcome
well
wheel
whole
wifi
window
winter
with
without
woke
wonder
work
working
worn
worse
worth
would
wouldn
wow
write
wrong
yard
year
years
yet
you
young
